pres/intRo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="es">
<head>
<meta charset="utf-8"/>
<title>Curso Introductorio a R</title>
<meta name="author" content="(Miguel Angel Escalante Serrato)"/>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/2.5.0/css/reveal.css"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/2.5.0/css/theme/night.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
<link href='http://fonts.googleapis.com/css?family=Source+Code+Pro' rel='stylesheet' type='text/css'>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>Curso Introductorio a R</h1>
<h2>Miguel Angel Escalante Serrato</h2>
<h2><a href="mailto:escalas5@gmail.com">escalas5@gmail.com</a></h2>
<h2></h2>
</section>

<section>
<section id="slide-sec-1">
<h2 id="sec-1">Temario</h2>
<div class="outline-text-2" id="text-1">
</div></section>
<section id="slide-sec-1-1">
<h3 id="sec-1-1">Clase 1</h3>
<div class="outline-text-3" id="text-1-1">
</div></section>
<section id="slide-sec-1-1-1">
<h4 id="sec-1-1-1">Introducción a R</h4>
<div class="outline-text-4" id="text-1-1-1">
</div><ul class="org-ul"><li><a id="sec-1-1-1-1" name="sec-1-1-1-1"></a>Filosofía del lenguaje<br  /></li>
<li><a id="sec-1-1-1-2" name="sec-1-1-1-2"></a>Orígen<br  /></li>
<li><a id="sec-1-1-1-3" name="sec-1-1-1-3"></a>¿Para qué?<br  /></li>
<li><a id="sec-1-1-1-4" name="sec-1-1-1-4"></a>Rstudio<br  /></li>
<li><a id="sec-1-1-1-5" name="sec-1-1-1-5"></a>Shiny<br  /></li></ul>
</section>
<section id="slide-sec-1-1-2">
<h4 id="sec-1-1-2">Introducción al lenguaje.</h4>
<div class="outline-text-4" id="text-1-1-2">
</div><ul class="org-ul"><li><a id="sec-1-1-2-1" name="sec-1-1-2-1"></a>Instalación ( con Rstudio. ).<br  /></li>
<li><a id="sec-1-1-2-2" name="sec-1-1-2-2"></a>Línea de comandos<br  /></li>
<li><a id="sec-1-1-2-3" name="sec-1-1-2-3"></a>Ayuda<br  /></li>
<li><a id="sec-1-1-2-4" name="sec-1-1-2-4"></a>Estructura de datos.<br  /><ul class="org-ul"><li><a id="sec-1-1-2-4-1" name="sec-1-1-2-4-1"></a>Vectores<br  /></li>
<li><a id="sec-1-1-2-4-2" name="sec-1-1-2-4-2"></a>Aritmética<br  /></li>
<li><a id="sec-1-1-2-4-3" name="sec-1-1-2-4-3"></a>Faltantes<br  /></li>
<li><a id="sec-1-1-2-4-4" name="sec-1-1-2-4-4"></a>Data Frames<br  /></li>
<li><a id="sec-1-1-2-4-5" name="sec-1-1-2-4-5"></a>Subsets<br  /></li>
<li><a id="sec-1-1-2-4-6" name="sec-1-1-2-4-6"></a>NA rm<br  /></li></ul>
</li></ul>
</section>
<section id="slide-sec-1-2">
<h3 id="sec-1-2">Clase 2</h3>
</section>
</section>
<section>
<section id="slide-sec-2">
<h2 id="sec-2">Bib</h2>
<ul>
<li><a href="http://www.quora.com/What-is-a-good-introduction-to-R">http://www.quora.com/What-is-a-good-introduction-to-R</a></li>
<li><a href="https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf">https://cran.r-project.org/doc/manuals/r-release/R-intro.pdf</a></li>
<li><a href="https://class.coursera.org/rprog-031/wiki/Week_2">https://class.coursera.org/rprog-031/wiki/Week_2</a></li>

</ul>
</section>
</section>
</div>
</div>

<script src="http://cdn.jsdelivr.net/reveal.js/2.5.0/lib/js/head.min.js"></script>
<script src="http://cdn.jsdelivr.net/reveal.js/2.5.0/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: true,
center: true,
slideNumber: true,
rollingLinks: false,
keyboard: true,
overview: true,
width: 1200,
height: 800,
margin: 0.10,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
]
});
</script>
</body>
</html>
